app/controllers/entries_controller.rb

SELECT "entries".* FROM "entries" ORDER BY "entries"."id" ASC
---
  def index
    @entries = Entry.order(:id)

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def show
    begin
      @entry = Entry.find(params[:id])